{
  "Easy": {
    "Present Simple": [
      "I work every day from 9 to 5.",
      "She usually drinks coffee in the morning.",
      "They play football on weekends.",
      "The sun rises in the east.",
      "We live in a big city.",
      "He speaks three languages.",
      "Water boils at 100 degrees.",
      "Children like to play outside.",
      "My brother studies at university.",
      "Birds fly in the sky.",
      "Cats sleep most of the day.",
      "The train leaves at 7 PM sharp.",
      "She always forgets her umbrella.",
      "We often go to the cinema on Fridays.",
      "He doesn't like loud music.",
      "The store opens at 9 AM.",
      "They have a big garden.",
      "I eat breakfast at 8 o'clock.",
      "It snows in winter here.",
      "My father reads the newspaper daily."
    ],
    "Present Continuous": [
      "She is reading a book now.",
      "They are watching TV at the moment.",
      "I am cooking dinner right now.",
      "He is sleeping in his room.",
      "We are learning English.",
      "The children are playing in the park.",
      "It is raining outside.",
      "My friends are waiting for me.",
      "The dog is barking loudly.",
      "She is wearing a red dress.",
      "I am trying to concentrate.",
      "He is fixing his bicycle.",
      "They are building a new house.",
      "We are having a great time.",
      "She is looking for her keys.",
      "The baby is crying.",
      "I am listening to music.",
      "He is teaching a class now.",
      "They are moving to a new apartment.",
      "The company is growing fast."
    ],
    "Future Simple": [
      "I will call you tomorrow.",
      "She will visit her grandparents.",
      "They will arrive at 5 o'clock.",
      "We will help you with this.",
      "He will buy a new car.",
      "It will be sunny tomorrow.",
      "I will send you an email.",
      "They will come to the party.",
      "She will finish her work soon.",
      "We will meet next week.",
      "He will probably be late.",
      "I will think about your offer.",
      "They will not accept these conditions.",
      "She will remember this day forever.",
      "We will need more time.",
      "The concert will start soon.",
      "I will never forget your kindness.",
      "He will understand one day.",
      "They will win the competition.",
      "I will wait for you here."
    ],
    "Past Simple": [
      "I visited Paris last year.",
      "She bought a new dress yesterday.",
      "They played tennis on Sunday.",
      "We watched a movie yesterday.",
      "He worked in London in 2010.",
      "It rained all day yesterday.",
      "I finished my homework an hour ago.",
      "She called me this morning.",
      "They traveled to Spain last summer.",
      "We ate pizza for dinner.",
      "He said he was sorry.",
      "I forgot to call you back.",
      "They left an hour ago.",
      "She passed her driving test.",
      "We lived in Canada for two years.",
      "The movie ended late.",
      "I didn't hear the doorbell.",
      "He broke his favorite cup.",
      "They decided to get married.",
      "I sent the letter last week."
    ]
  },
  "Normal": {
    "Present Perfect": [
      "I have already seen this film.",
      "She has lived here for five years.",
      "They have finished their project.",
      "We have never been to China.",
      "He has just left the office.",
      "I have known her since childhood.",
      "They have visited ten countries.",
      "She has lost her keys.",
      "We have bought a new house.",
      "He has worked here since 2018.",
      "I have changed my mind.",
      "She has never tried sushi.",
      "We have already discussed this.",
      "He has written three books.",
      "They have made a decision.",
      "I have always loved music.",
      "She has improved her English a lot.",
      "We have seen that show twice.",
      "He has broken his phone.",
      "They have become good friends."
    ],
    "Past Continuous": [
      "I was sleeping when you called.",
      "They were watching TV at 8 PM.",
      "She was cooking dinner when I arrived.",
      "We were studying all evening.",
      "He was driving to work when it happened.",
      "They were playing chess while it was raining.",
      "I was reading a book when the phone rang.",
      "She was talking on the phone for an hour.",
      "We were waiting for the bus.",
      "He was working on his computer.",
      "I was walking home when I met her.",
      "They were arguing loudly.",
      "She was practicing the piano all morning.",
      "We were having dinner when the power went out.",
      "He was repairing his car yesterday afternoon.",
      "The kids were making a fort in the living room.",
      "I was thinking about you.",
      "They were looking for a new apartment.",
      "She was wearing a beautiful dress.",
      "We were planning our vacation."
    ],
    "Future with 'going to'": [
      "I am going to visit my parents.",
      "She is going to study medicine.",
      "They are going to buy a house.",
      "We are going to travel to Japan.",
      "He is going to start a new job.",
      "It is going to rain soon.",
      "I am going to learn Spanish.",
      "They are going to get married.",
      "She is going to write a book.",
      "We are going to move to a new city.",
      "He is going to clean his room.",
      "I am going to make a cake.",
      "They are going to play football this weekend.",
      "She is going to cut her hair.",
      "We are going to sell our car.",
      "I am going to tell him the truth.",
      "They are going to build a swimming pool.",
      "He is going to take a break.",
      "We are going to organize a party.",
      "I am going to look for a new job."
    ],
    "Present Perfect Continuous": [
      "I have been waiting for an hour.",
      "She has been studying all day.",
      "They have been living here since 2015.",
      "We have been working on this project for months.",
      "He has been learning English for two years.",
      "It has been raining since morning.",
      "I have been reading this book for weeks.",
      "They have been dating for three years.",
      "She has been teaching at this school for a long time.",
      "We have been planning this trip for ages.",
      "He has been exercising regularly.",
      "I have been feeling tired lately.",
      "They have been trying to reach you.",
      "She has been working too hard.",
      "We have been saving money for a car.",
      "I have been thinking about changing jobs.",
      "He has been playing guitar since he was ten.",
      "They have been discussing the problem all day.",
      "She has been looking for a new apartment.",
      "We have been waiting for this moment."
    ],
    "First Conditional": [
      "If it rains, we will stay home.",
      "If you study hard, you will pass the exam.",
      "If he calls, I will tell him.",
      "If they come early, we can start.",
      "If I have time, I will help you.",
      "If she doesn't hurry, she will be late.",
      "If we leave now, we will arrive on time.",
      "If you don't practice, you won't improve.",
      "If it's sunny, we will go to the beach.",
      "If he agrees, we can begin tomorrow.",
      "If you need help, just ask me.",
      "If the price is good, I will buy it.",
      "If she feels better, she will come to the party.",
      "If we don't finish today, we'll continue tomorrow.",
      "If you touch that, you'll burn yourself.",
      "If he doesn't apologize, I won't forgive him.",
      "If they offer me the job, I'll take it.",
      "If we miss the bus, we'll take a taxi.",
      "If you don't water the plants, they will die.",
      "If I see him, I'll give him your message."
    ]
  },
  "Hard": {
    "Past Perfect": [
      "I had never seen such a beautiful place before.",
      "She had already left when I arrived.",
      "They had finished the work by 5 o'clock.",
      "We had visited that museum before it closed.",
      "He had lived in London before moving to Paris.",
      "I had just finished eating when they called.",
      "She had studied French before learning Spanish.",
      "They had never been abroad until last year.",
      "We had already seen the movie twice.",
      "He had worked there for ten years before retiring.",
      "I had forgotten that we had met before.",
      "She had already read the book before watching the movie.",
      "They had prepared everything before the guests arrived.",
      "He had never flown before that trip.",
      "We had decided to leave before the situation worsened.",
      "I had locked the door before going to bed.",
      "She had never tried Indian food until last week.",
      "They had completed the project before the deadline.",
      "He had saved enough money before buying the car.",
      "We had visited Paris twice before moving there."
    ],
    "Future Perfect": [
      "By next year, I will have graduated.",
      "She will have finished the report by Friday.",
      "They will have arrived by this time tomorrow.",
      "We will have been married for 10 years next month.",
      "He will have completed the project by December.",
      "By 2030, electric cars will have become common.",
      "I will have saved enough money by summer.",
      "They will have built the bridge by next year.",
      "She will have learned three languages by then.",
      "We will have traveled to all continents by 2025.",
      "By tomorrow, I will have finished this book.",
      "He will have repaired the car by evening.",
      "They will have painted the house by weekend.",
      "By next month, she will have recovered completely.",
      "I will have packed my bags by the time you arrive.",
      "They will have decided by tomorrow.",
      "By Christmas, we will have moved to the new house.",
      "He will have mastered the skill by next year.",
      "By the end of the day, I will have answered all emails.",
      "She will have prepared dinner by 7 PM."
    ],
    "Second Conditional": [
      "If I were rich, I would travel the world.",
      "If she had time, she would help you.",
      "If they lived closer, we would visit them often.",
      "If I knew the answer, I would tell you.",
      "If it weren't raining, we would go for a walk.",
      "If he studied more, he would get better grades.",
      "If we had a car, we could drive there.",
      "If I were you, I would take that job.",
      "If they spoke English, they would understand.",
      "If it were warmer, we could swim in the lake.",
      "If I had more free time, I would learn to play guitar.",
      "If she liked animals, she would get a pet.",
      "If they knew the truth, they would be shocked.",
      "If I had his number, I would call him.",
      "If we had enough money, we would buy a boat.",
      "If you asked nicely, she might agree.",
      "If I were taller, I would play basketball.",
      "If it weren't so expensive, we would eat there more often.",
      "If he practiced regularly, he would be a great musician.",
      "If we lived by the sea, we would go swimming every day."
    ],
    "Third Conditional": [
      "If I had known, I would have helped.",
      "If she had studied harder, she would have passed.",
      "If they had left earlier, they would have arrived on time.",
      "If we had taken the train, we would have been faster.",
      "If he had listened to me, he wouldn't have made that mistake.",
      "If I had had more time, I would have visited you.",
      "If she had called me, I would have answered.",
      "If they had invested wisely, they would be rich now.",
      "If we had known about the traffic, we would have taken another route.",
      "If he had accepted the offer, he would be working here now.",
      "If I had seen him, I would have said hello.",
      "If she had taken the job, she would have earned more money.",
      "If they had booked in advance, they would have gotten better seats.",
      "If we had brought a map, we wouldn't have gotten lost.",
      "If he had worn a coat, he wouldn't have caught a cold.",
      "If I had checked the weather, I would have brought an umbrella.",
      "If she had asked for help, we would have helped her.",
      "If they had practiced more, they would have won the competition.",
      "If we had known you were coming, we would have prepared dinner.",
      "If he had saved money, he could have bought a house."
    ],
    "Past Perfect Continuous": [
      "I had been waiting for two hours when he finally came.",
      "She had been working there for five years before she quit.",
      "They had been dating for a long time before they got married.",
      "We had been driving for hours when we saw the sign.",
      "He had been studying all night before the exam.",
      "I had been living in London for three years before I moved.",
      "She had been practicing for months before the concert.",
      "They had been planning the trip for years.",
      "We had been discussing the problem for hours.",
      "He had been running for 30 minutes when he got tired.",
      "I had been trying to reach you all morning.",
      "She had been teaching at that school for a decade before retiring.",
      "They had been saving money for years before buying the house.",
      "He had been playing football since childhood before his injury.",
      "We had been looking for a solution for weeks.",
      "I had been working on that project for months before abandoning it.",
      "She had been learning French for years before visiting Paris.",
      "They had been building the house for months before the storm damaged it.",
      "He had been complaining about pain for weeks before seeing a doctor.",
      "We had been waiting for the results for days when they finally arrived."
    ],
    "Future Perfect Continuous": [
      "By next month, I will have been working here for five years.",
      "By 2025, she will have been teaching for twenty years.",
      "They will have been traveling for six months by Christmas.",
      "We will have been living in this house for a decade next year.",
      "By tomorrow, he will have been waiting for 24 hours.",
      "I will have been studying English for three years by summer.",
      "She will have been running her business for fifteen years.",
      "They will have been building the bridge for two years.",
      "We will have been married for twenty-five years in June.",
      "He will have been practicing law for thirty years by then.",
      "By next week, I will have been recovering for a month.",
      "She will have been learning piano for five years in December.",
      "They will have been dating for ten years next month.",
      "By tomorrow, we will have been driving for two days.",
      "He will have been training for the marathon for six months.",
      "I will have been writing this book for a year by January.",
      "She will have been volunteering at the hospital for three years.",
      "They will have been developing the software for eighteen months.",
      "We will have been growing these vegetables for three seasons.",
      "By the time he retires, he will have been working for forty years."
    ],
    "Mixed Conditionals": [
      "If I had studied medicine, I would be a doctor now.",
      "If she hadn't missed the train, she would be here already.",
      "If they had invested then, they would be wealthy today.",
      "If I had learned Spanish, I would be working in Madrid.",
      "If he had taken that job, he would be living in New York.",
      "If we had bought that house, we would be living by the sea.",
      "If she had accepted the offer, she would be the manager now.",
      "If they had started earlier, they would have finished by now.",
      "If I had known you were coming, I would have baked a cake.",
      "If he had saved money, he would be able to buy a car now.",
      "If I had practiced more, I would be a better musician now.",
      "If she had listened to my advice, she wouldn't be in trouble now.",
      "If they had taken the other road, they would have arrived by now.",
      "If I had bought that stock, I would be rich today.",
      "If he hadn't broken his leg, he would be playing in the match today.",
      "If we had left earlier, we wouldn't be stuck in traffic now.",
      "If she had studied harder, she would have a degree now.",
      "If they had saved more money, they would be on vacation now.",
      "If I had known about the test, I would have studied yesterday.",
      "If he had maintained his car, it wouldn't be broken down now."
    ]
  }
}